## Q1
- 여러분은 파이썬을 통해 설문조사 문항의 응답내역을 분석하게 되었습니다. 문항별 응답내용에는 하나의 응답만 할 수 있는 single choice 문제와 여러 응답을 선택할 수 있는 multiple choice 문제가 있습니다. 2개를 구분하기 위해 single choice 문항 번호에 "_"를 표기하지 않기로 했습니다.

- 문항별 응답내역이 'question'에 담겨 있을 때, 조건문과 반복문을 사용하여 아래와 같은 결과가 출력되도록 코드를 작성해보세요.

In [9]:
question = ['Q2', 'Q3', 'Q4', 'Q5', 'Q6_1', 'Q6_2', 'Q6_3', 'Q6_4', 'Q6_5', 'Q6_6',
       'Q6_7', 'Q6_8', 'Q6_9', 'Q6_10', 'Q6_11', 'Q6_12', 'Q7_1', 'Q7_2',
       'Q7_3', 'Q7_4', 'Q7_5', 'Q7_6', 'Q7_7', 'Q8', 'Q9', 'Q10_1', 'Q10_2',
       'Q10_3']

single_choice = ['Q2', 'Q3', 'Q4', 'Q5', 'Q8', 'Q9']
multiple_choice = ['Q6_1', 'Q6_2', 'Q6_3', 'Q6_4', 'Q6_5', 'Q6_6', 'Q6_7', 'Q6_8', 'Q6_9', 'Q6_10', 'Q6_11', 'Q6_12', 'Q7_1', 'Q7_2', 'Q7_3', 'Q7_4', 'Q7_5', 'Q7_6', 'Q7_7', 'Q10_1', 'Q10_2', 'Q10_3']

choice = input("")

if choice in single_choice:
    print(single_choice)
elif choice in multiple_choice:
    print(multiple_choice)
else:
    print("잘못된 선택입니다. 'single' 또는 'multiple' 중에서 선택하세요.")

Q2
['Q2', 'Q3', 'Q4', 'Q5', 'Q8', 'Q9']

## Q2
- 한스 로슬링(Hans Rosling, 1948년 7월 27일 ~ 2017년 2월 7일)은 스웨덴의 의사이자 통계학자로 비영리 벤처 갭마인더 재단의 공동설립자이기도 합니다. 빅데이터를 가장 잘 활용하는 보건 통계학자로 알려져 있습니다. 베스트셀러 책인 "팩트풀니스" 저자이기도 합니다. 갭마인더 사이트에서는 연도별, 국가별 GDP와 기대수명 데이터를 제공하고 있는데, 대표적으로 파이썬 라이브러리 중 'seaborn'에서 제공되는 예제 데이터가 있습니다. 오늘은 이 데이터를 활용해 문제를 풀어보겠습니다.
- 다음의 데이터는 연도, 국가별 기대수명을 나타내고 있는 데이터 입니다. 2011년 부터의 연도별, 국가별 평균 기대수명을 구해주세요. (2011년도 포함되게 구합니다.)

- [필수 조건] groupby 나 pivot_table을 활용합니다. groupby 로 구할 때 unstack()이라는 기능을 사용하여 아래와 같이 컬럼에 인덱스 값을 올려서 표기할 수 있습니다.
- 만약 행에는 '연도'가, 열에 '국가'가 들어있고 수치 데이터의 결과값이 아래와 같다면, 출력형태는 조금 달라도 괜찮습니다.

In [10]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/healthexp.csv")
df

     Year        Country  Spending_USD  Life_Expectancy
0    1970        Germany       252.311             70.6
1    1970         France       192.143             72.2
2    1970  Great Britain       123.993             71.9
3    1970          Japan       150.437             72.0
4    1970            USA       326.961             70.9
..    ...            ...           ...              ...
269  2020        Germany      6938.983             81.1
270  2020         France      5468.418             82.3
271  2020  Great Britain      5018.700             80.4
272  2020          Japan      4665.641             84.7
273  2020            USA     11859.179             77.0

[274 rows x 4 columns]

In [11]:
df_x = df[(df['Year'] >= 2011)]
df_sp= df_x.pivot_table(index='Year', columns='Country', values='Life_Expectancy')
df_sp.columns.name = None

df_sp

      Canada  France  Germany  Great Britain  Japan   USA
Year
2011    81.4    82.3     80.5           81.0   82.7  78.7
2012    81.6    82.1     80.6           81.0   83.2  78.8
2013    81.7    82.3     80.6           81.1   83.4  78.8
2014    81.8    82.8     81.2           81.4   83.7  78.9
2015    81.9    82.4     80.7           81.0   83.9  78.7
2016    82.0    82.7     81.0           81.2   84.1  78.7
2017    81.9    82.7     81.1           81.3   84.2  78.6
2018    82.0    82.8     81.0           81.3   84.3  78.7
2019    82.2    82.9     81.3           81.4   84.4  78.8
2020    81.7    82.3     81.1           80.4   84.7  77.0

## 📌Q3. Jupyter notebook 은 문서와 코드를 함께 작성할 수 있다는 점이 장점입니다. Jupyter notebook 에서 지원하는 Markdown 문법을 사용하여, 이번 주에 배운 내용을 정리해 보세요!

- Pandas를 통한 파일 저장과 불러오기
    - to_csv("파일명", index=False) : csv 파일로 저장하기
    - read_csv("파일명") : csv 파일 불러오기
    - shape를 통한 행과 열의 수 보기
    - head, tail, sample 을 통한 일부 데이터 가져오기

In [12]:
import pandas as pd
df_x = pd.DataFrame(df)

In [13]:
# to_csv("파일명", index=False) : csv 파일로 저장하기
df.to_csv('df_sp',index=False)

In [14]:
# read_csv("파일명") : csv 파일 불러오기
df_load = pd.read_csv("df_sp")

In [15]:
# shape를 통한 행과 열의 수 보기
df_load.shape

(274, 4)

In [16]:
# head
df_head = df_load.head(2)
df_head

   Year  Country  Spending_USD  Life_Expectancy
0  1970  Germany       252.311             70.6
1  1970   France       192.143             72.2

In [17]:
# tail
df_tail = df_load.tail(2)
df_tail

     Year Country  Spending_USD  Life_Expectancy
272  2020   Japan      4665.641             84.7
273  2020     USA     11859.179             77.0

In [18]:
# sample
df_sample = df_load.sample(2)
df_sample

    Year Country  Spending_USD  Life_Expectancy
39  1980  France       659.826             74.3
56  1983   Japan       714.857             77.0

- DataFrame의 info(), describe() 등을 통한 요약과 기술통계 값 구하기
    - info()
    - describe()
    - nunique()
    - index
    - columns
    - values

In [19]:
# info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 274 entries, 0 to 273
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Year             274 non-null    int64
 1   Country          274 non-null    object
 2   Spending_USD     274 non-null    float64
 3   Life_Expectancy  274 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 8.7+ KB

In [20]:
# describe()
df.describe()

              Year  Spending_USD  Life_Expectancy
count   274.000000    274.000000       274.000000
mean   1996.992701   2789.338905        77.909489
std      14.180933   2194.939785         3.276263
min    1970.000000    123.993000        70.600000
25%    1985.250000   1038.357000        75.525000
50%    1998.000000   2295.578000        78.100000
75%    2009.000000   4055.610000        80.575000
max    2020.000000  11859.179000        84.700000

In [21]:
# index
df_a = df.nunique()
df_a

Year                51
Country              6
Spending_USD       274
Life_Expectancy    118
dtype: int64

In [22]:
# columns
df.columns

Index(['Year', 'Country', 'Spending_USD', 'Life_Expectancy'], dtype='object')

In [23]:
# values
df.values

array([[1970, 'Germany', 252.311, 70.6],
       [1970, 'France', 192.143, 72.2],
       [1970, 'Great Britain', 123.993, 71.9],
       ...,
       [2020, 'Great Britain', 5018.7, 80.4],
       [2020, 'Japan', 4665.641, 84.7],
       [2020, 'USA', 11859.179, 77.0]], dtype=object)

- Pandas의 DataFrame과 Series의 이해
    - Series : 1차원 벡터구조
    - DataFrame : 2차원 행렬구조

In [24]:
df_1 = [1,2,3]
series = pd.Series(df_a)

In [25]:
series

Year                51
Country              6
Spending_USD       274
Life_Expectancy    118
dtype: int64

In [26]:
df_2 = {'a':[1,2,3,4],'b':[5,6,7,8],'c':[9,10,11,12]}
df_2 = pd.DataFrame(df_2)

In [27]:
df_2

   a  b   c
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

- 색인하기
    - [컬럼]
    - .loc[행]
    - .loc[행, 열]
    - .loc[조건식, 열]

In [28]:
# 컬럼
df_column = df_2['a']
df_column

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [29]:
# .loc[행]
df_2.loc[3]

a     4
b     8
c    12
Name: 3, dtype: int64

In [30]:
# .loc[행, 열]
df_2.loc[3, 'a']

4

In [31]:
# .loc[조건식, 열]
df_2.loc[df_2['a'] > 2, 'b']

2    7
3    8
Name: b, dtype: int64

- DataFrame의 데이터 타입 이해하기
    - 날짜 데이터의 변환

In [32]:
df_2.dtypes

a    int64
b    int64
c    int64
dtype: object

In [33]:
df_2['a'] = pd.to_datetime(df_2['a'])
df_2.dtypes

a    datetime64[ns]
b             int64
c             int64
dtype: object

- DataFrame 다루기
    - 열(column) 인덱싱
    - 행(index) 인덱싱
    - 행, 열 인덱싱
    - 정렬하기 : sort_values 사용하기
    - 조건식 사용하기

In [34]:
# 열(column) 인덱싱
df_A = df_2['b']
df_A

0    5
1    6
2    7
3    8
Name: b, dtype: int64

In [35]:
# 행(index) 인덱싱
df_B = df_2.loc[3]
df_B

a    1970-01-01 00:00:00.000000004
b                                8
c                               12
Name: 3, dtype: object

In [36]:
# 행, 열 인덱싱
df_C = df_2.loc[1, 'b']
df_C

6

In [37]:
# 정렬하기 : sort_values 사용하기
df_sort = df_2.sort_values(by='b', ascending=False)
df_sort

                              a  b   c
3 1970-01-01 00:00:00.000000004  8  12
2 1970-01-01 00:00:00.000000003  7  11
1 1970-01-01 00:00:00.000000002  6  10
0 1970-01-01 00:00:00.000000001  5   9

In [38]:
# 조건식 사용하기
df_filter = df_2[df_2['b'] > 5]
df_filter

                              a  b   c
1 1970-01-01 00:00:00.000000002  6  10
2 1970-01-01 00:00:00.000000003  7  11
3 1970-01-01 00:00:00.000000004  8  12

- 빈도수 구하기
    - 한 개의 변수 : series.value_counts()
    - 두 개의 변수 : pd.crosstab()

In [39]:
# 한 개의 변수 : series.value_counts()
series = df_2['c']
frequency = series.value_counts()
frequency

9     1
10    1
11    1
12    1
Name: c, dtype: int64

In [40]:
# 두 개의 변수 : pd.crosstab()
cross_tab = pd.crosstab(df_2['b'], df_2['c'])
cross_tab

c  9   10  11  12
b
5   1   0   0   0
6   0   1   0   0
7   0   0   1   0
8   0   0   0   1

- groupby 와 pivot_table
    - 다양한 연산식의 사용

In [41]:
group = df_2.groupby('b')['c'].mean()
group

b
5     9.0
6    10.0
7    11.0
8    12.0
Name: c, dtype: float64

In [42]:
pivot = df_2.pivot_table(index='b', values='c', aggfunc='mean')
pivot

    c
b
5   9
6  10
7  11
8  12

## 📌Q4. 앞으로 우리는 공공데이터포털에서 데이터를 다운로드 받아 과정을 진행할 예정입니다. 본격적인 학습 이전에! 데이터를 다루는 방법이 익숙해지도록 한번 더 연습해보고, 어떤 문제를 풀 수 있을지도 함께 고민해보아요!

- 공공데이터포털에서 원하는 데이터를 다운로드 받아 경로를 설정하고, 주피터 노트북과 판다스를 통해 불러와 보세요! 어떤 데이터를 사용해야할지 고민된다면 다음 링크의 데이터를 다운로드 받아도 좋습니다.
- 이 때, 인코딩 오류가 발생한다면 encoding="cp949" 옵션을 사용해 주세요! cp949는 한글 윈도우에서 사용하는 인코딩 방식이랍니다. 인코딩과 관련된 자세한 내용은 다음을 참고해 주세요.

In [56]:
%pwd

'C:\\Users\\jh060\\데이터 분석\\부스트코스'

In [64]:
data = pd.read_csv("Data/서울특별시 강남구_생활폐기물배출량_20221019.csv", encoding="cp949")